bench_db/insert_noauto/test/8_100000
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Random number generator seed is 0 and will be ignored


Threads started!

[  10s] threads: 8, tps: 471.86, reads/s: 0.00, writes/s: 471.96 response time: 38.21ms (95%)
[  20s] threads: 8, tps: 488.01, reads/s: 0.00, writes/s: 488.71 response time: 34.74ms (95%)
[  30s] threads: 8, tps: 372.58, reads/s: 0.00, writes/s: 372.38 response time: 33.46ms (95%)
[  40s] threads: 8, tps: 761.44, reads/s: 0.00, writes/s: 761.14 response time: 14.78ms (95%)
[  50s] threads: 8, tps: 297.73, reads/s: 0.00, writes/s: 297.83 response time: 45.62ms (95%)
[  60s] threads: 8, tps: 554.53, reads/s: 0.00, writes/s: 554.43 response time: 22.41ms (95%)
[  70s] threads: 8, tps: 669.85, reads/s: 0.00, writes/s: 669.85 response time: 21.07ms (95%)
[  80s] threads: 8, tps: 700.09, reads/s: 0.00, writes/s: 700.09 response time: 16.66ms (95%)
[  90s] threads: 8, tps: 466.06, reads/s: 0.00, writes/s: 466.06 response time: 24.11ms (95%)
[ 100s] threads: 8, tps: 407.94, reads/s: 0.00, writes/s: 407.94 response time: 23.55ms (95%)
[ 110s] threads: 8, tps: 736.04, reads/s: 0.00, writes/s: 736.04 response time: 16.29ms (95%)
[ 120s] threads: 8, tps: 608.01, reads/s: 0.00, writes/s: 608.11 response time: 23.55ms (95%)
[ 130s] threads: 8, tps: 602.02, reads/s: 0.00, writes/s: 601.92 response time: 19.49ms (95%)
[ 140s] threads: 8, tps: 578.01, reads/s: 0.00, writes/s: 578.51 response time: 21.46ms (95%)
[ 150s] threads: 8, tps: 462.09, reads/s: 0.00, writes/s: 462.09 response time: 28.07ms (95%)
[ 160s] threads: 8, tps: 626.81, reads/s: 0.00, writes/s: 626.21 response time: 18.40ms (95%)
[ 170s] threads: 8, tps: 655.05, reads/s: 0.00, writes/s: 655.05 response time: 20.50ms (95%)
OLTP test statistics:
    queries performed:
        read:                            0
        write:                           100000
        other:                           200000
        total:                           300000
    transactions:                        100000 (557.60 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 100000 (557.60 per sec.)
    other operations:                    200000 (1115.19 per sec.)

General statistics:
    total time:                          179.3412s
    total number of events:              100000
    total time taken by event execution: 1433.2986s
    response time:
         min:                                  0.37ms
         avg:                                 14.33ms
         max:                               2060.86ms
         approx.  95 percentile:              22.11ms

Threads fairness:
    events (avg/stddev):           12500.0000/88.40
    execution time (avg/stddev):   179.1623/0.00

sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Random number generator seed is 0 and will be ignored


Threads started!

[  10s] threads: 8, tps: 558.00, reads/s: 0.00, writes/s: 558.30 response time: 27.54ms (95%)
[  20s] threads: 8, tps: 625.99, reads/s: 0.00, writes/s: 625.89 response time: 18.88ms (95%)
[  30s] threads: 8, tps: 627.19, reads/s: 0.00, writes/s: 627.39 response time: 18.71ms (95%)
[  40s] threads: 8, tps: 520.54, reads/s: 0.00, writes/s: 520.54 response time: 29.14ms (95%)
[  50s] threads: 8, tps: 533.09, reads/s: 0.00, writes/s: 533.19 response time: 20.15ms (95%)
[  60s] threads: 8, tps: 499.03, reads/s: 0.00, writes/s: 498.93 response time: 27.92ms (95%)
[  70s] threads: 8, tps: 549.65, reads/s: 0.00, writes/s: 549.45 response time: 21.60ms (95%)
[  80s] threads: 8, tps: 566.47, reads/s: 0.00, writes/s: 567.07 response time: 24.32ms (95%)
[  90s] threads: 8, tps: 515.49, reads/s: 0.00, writes/s: 514.99 response time: 33.98ms (95%)
[ 100s] threads: 8, tps: 530.33, reads/s: 0.00, writes/s: 530.53 response time: 28.92ms (95%)
[ 110s] threads: 8, tps: 706.08, reads/s: 0.00, writes/s: 706.08 response time: 21.88ms (95%)
[ 120s] threads: 8, tps: 600.01, reads/s: 0.00, writes/s: 599.61 response time: 26.80ms (95%)
[ 130s] threads: 8, tps: 473.96, reads/s: 0.00, writes/s: 473.96 response time: 29.49ms (95%)
[ 140s] threads: 8, tps: 664.02, reads/s: 0.00, writes/s: 664.22 response time: 27.88ms (95%)
[ 150s] threads: 8, tps: 611.95, reads/s: 0.00, writes/s: 611.85 response time: 20.74ms (95%)
[ 160s] threads: 8, tps: 665.95, reads/s: 0.00, writes/s: 666.25 response time: 19.45ms (95%)
[ 170s] threads: 8, tps: 561.70, reads/s: 0.00, writes/s: 561.60 response time: 20.43ms (95%)
OLTP test statistics:
    queries performed:
        read:                            0
        write:                           100000
        other:                           200000
        total:                           300000
    transactions:                        100000 (582.19 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 100000 (582.19 per sec.)
    other operations:                    200000 (1164.38 per sec.)

General statistics:
    total time:                          171.7646s
    total number of events:              100000
    total time taken by event execution: 1372.5618s
    response time:
         min:                                  0.37ms
         avg:                                 13.73ms
         max:                               1282.24ms
         approx.  95 percentile:              23.96ms

Threads fairness:
    events (avg/stddev):           12500.0000/115.81
    execution time (avg/stddev):   171.5702/0.02

sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Random number generator seed is 0 and will be ignored


Threads started!

[  10s] threads: 8, tps: 683.94, reads/s: 0.00, writes/s: 684.14 response time: 16.68ms (95%)
[  20s] threads: 8, tps: 657.61, reads/s: 0.00, writes/s: 657.91 response time: 18.84ms (95%)
[  30s] threads: 8, tps: 476.05, reads/s: 0.00, writes/s: 475.85 response time: 35.33ms (95%)
[  40s] threads: 8, tps: 499.81, reads/s: 0.00, writes/s: 499.81 response time: 30.18ms (95%)
[  50s] threads: 8, tps: 614.46, reads/s: 0.00, writes/s: 614.56 response time: 18.30ms (95%)
[  60s] threads: 8, tps: 601.76, reads/s: 0.00, writes/s: 601.66 response time: 18.24ms (95%)
[  70s] threads: 8, tps: 522.23, reads/s: 0.00, writes/s: 522.03 response time: 22.26ms (95%)
[  80s] threads: 8, tps: 639.99, reads/s: 0.00, writes/s: 639.99 response time: 21.42ms (95%)
[  90s] threads: 8, tps: 697.70, reads/s: 0.00, writes/s: 697.90 response time: 21.12ms (95%)
[ 100s] threads: 8, tps: 788.54, reads/s: 0.00, writes/s: 789.04 response time: 17.15ms (95%)
[ 110s] threads: 8, tps: 491.79, reads/s: 0.00, writes/s: 491.79 response time: 32.90ms (95%)
[ 120s] threads: 8, tps: 492.12, reads/s: 0.00, writes/s: 491.82 response time: 31.42ms (95%)
[ 130s] threads: 8, tps: 601.93, reads/s: 0.00, writes/s: 601.73 response time: 20.27ms (95%)
[ 140s] threads: 8, tps: 694.08, reads/s: 0.00, writes/s: 694.28 response time: 18.67ms (95%)
[ 150s] threads: 8, tps: 599.63, reads/s: 0.00, writes/s: 599.53 response time: 20.47ms (95%)
[ 160s] threads: 8, tps: 558.32, reads/s: 0.00, writes/s: 558.52 response time: 21.77ms (95%)
OLTP test statistics:
    queries performed:
        read:                            0
        write:                           100002
        other:                           200004
        total:                           300006
    transactions:                        100002 (610.57 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 100002 (610.57 per sec.)
    other operations:                    200004 (1221.13 per sec.)

General statistics:
    total time:                          163.7855s
    total number of events:              100002
    total time taken by event execution: 1306.9686s
    response time:
         min:                                  0.40ms
         avg:                                 13.07ms
         max:                                954.14ms
         approx.  95 percentile:              21.78ms

Threads fairness:
    events (avg/stddev):           12500.2500/128.61
    execution time (avg/stddev):   163.3711/0.01